Report/Stage4/Testing/2m/wrk_get_8081_2m.txt
Running 2m test @ http://localhost:8081
  4 threads and 128 connections
  Thread calibration: mean lat.: 410.348ms, rate sampling interval: 1361ms
  Thread calibration: mean lat.: 407.968ms, rate sampling interval: 1356ms
  Thread calibration: mean lat.: 447.927ms, rate sampling interval: 1348ms
  Thread calibration: mean lat.: 461.230ms, rate sampling interval: 1377ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    61.97ms  166.68ms 732.67ms   90.84%
    Req/Sec   502.89     22.06   640.00     90.62%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.78ms
 75.000%   13.78ms
 90.000%  144.00ms
 99.000%  705.53ms
 99.900%  721.92ms
 99.990%  729.09ms
 99.999%  732.67ms
100.000%  733.18ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.228     0.000000            3         1.00
       0.994     0.100000        22151         1.11
       1.492     0.200000        44241         1.25
       2.715     0.300000        66319         1.43
       6.611     0.400000        88459         1.67
       8.783     0.500000       110551         2.00
       9.567     0.550000       121630         2.22
      10.447     0.600000       132693         2.50
      11.495     0.650000       143767         2.86
      12.559     0.700000       154822         3.33
      13.783     0.750000       165859         4.00
      14.615     0.775000       171361         4.44
      15.759     0.800000       176859         5.00
      17.695     0.825000       182395         5.71
      22.223     0.850000       187907         6.67
      37.951     0.875000       193424         8.00
      67.071     0.887500       196186         8.89
     143.999     0.900000       198952        10.00
     325.887     0.912500       201714        11.43
     414.975     0.925000       204476        13.33
     472.575     0.937500       207256        16.00
     507.135     0.943750       208622        17.78
     563.199     0.950000       210014        20.00
     615.935     0.956250       211392        22.86
     678.399     0.962500       212794        26.67
     686.591     0.968750       214214        32.00
     689.663     0.971875       214893        35.56
     692.735     0.975000       215593        40.00
     695.295     0.978125       216314        45.71
     697.855     0.981250       217042        53.33
     700.415     0.984375       217704        64.00
     701.439     0.985938       217965        71.11
     702.975     0.987500       218334        80.00
     704.511     0.989062       218693        91.43
     706.047     0.990625       219020       106.67
     708.095     0.992188       219434       128.00
     708.607     0.992969       219524       142.22
     709.631     0.993750       219697       160.00
     711.167     0.994531       219885       182.86
     712.703     0.995313       220059       213.33
     714.239     0.996094       220238       256.00
     714.751     0.996484       220291       284.44
     715.775     0.996875       220396       320.00
     716.799     0.997266       220486       365.71
     717.823     0.997656       220586       426.67
     718.335     0.998047       220625       512.00
     719.359     0.998242       220696       568.89
     719.871     0.998437       220729       640.00
     720.383     0.998633       220766       731.43
     720.895     0.998828       220803       853.33
     721.919     0.999023       220850      1024.00
     722.431     0.999121       220863      1137.78
     723.455     0.999219       220897      1280.00
     723.967     0.999316       220914      1462.86
     724.479     0.999414       220936      1706.67
     724.991     0.999512       220952      2048.00
     725.503     0.999561       220967      2275.56
     726.015     0.999609       220979      2560.00
     726.015     0.999658       220979      2925.71
     726.527     0.999707       220990      3413.33
     727.551     0.999756       221009      4096.00
     727.551     0.999780       221009      4551.11
     728.063     0.999805       221020      5120.00
     728.063     0.999829       221020      5851.43
     728.575     0.999854       221031      6826.67
     728.575     0.999878       221031      8192.00
     728.575     0.999890       221031      9102.22
     729.087     0.999902       221035     10240.00
     729.599     0.999915       221040     11702.86
     729.599     0.999927       221040     13653.33
     730.111     0.999939       221042     16384.00
     730.111     0.999945       221042     18204.44
     731.135     0.999951       221044     20480.00
     731.647     0.999957       221047     23405.71
     731.647     0.999963       221047     27306.67
     732.159     0.999969       221050     32768.00
     732.159     0.999973       221050     36408.89
     732.159     0.999976       221050     40960.00
     732.159     0.999979       221050     46811.43
     732.159     0.999982       221050     54613.33
     732.671     0.999985       221053     65536.00
     732.671     0.999986       221053     72817.78
     732.671     0.999988       221053     81920.00
     732.671     0.999989       221053     93622.86
     732.671     0.999991       221053    109226.67
     732.671     0.999992       221053    131072.00
     732.671     0.999993       221053    145635.56
     732.671     0.999994       221053    163840.00
     732.671     0.999995       221053    187245.71
     732.671     0.999995       221053    218453.33
     733.183     0.999996       221054    262144.00
     733.183     1.000000       221054          inf
#[Mean    =       61.968, StdDeviation   =      166.676]
#[Max     =      732.672, Total count    =       221054]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  238991 requests in 2.00m, 21.48MB read
  Non-2xx or 3xx responses: 163845
Requests/sec:   1990.84
Transfer/sec:    183.25KB